/*
Задача 1
Напишите хранимую процедуру для расчета количества сотрудников на должности.
Процедура должна содержать входящий параметр - наименование должности и выходящий параметр - кол-во сотрудников.
Реализуйте проверку на существование сотрудника, выведите соответствующее сообщение.

Задача 2
Реализовать хранимую процедуру для перевода сотрудника из одного департамента в другой.
В рамках хранимой процедуры необходимо:
	- Закрыть текущую запись о департаменте - update
	- Добавить новую запись о департаменте - insert
    - Используется таблица[HumanResources].[EmployeeDepartmentHistory]
*/

