/*
Многострочный
	комментарий
*/
--==========================================1=============================================
-- Переключение контекста базы данных
use [SQL 22-1];
--==========================================2=============================================
GO -- Разделение на несколько пакетов
-- Создание схемы
create schema lesson1;
GO
--==========================================3=============================================


-- Удалить объект в случае если он существует
if object_id('lesson1.Employee', 'U') is not null drop table lesson1.Employee;


-- Создание таблицы работников
create table lesson1.Employee (
       ID         int,            -- уникальный идент. сотрудника
	   AGE        tinyint,        -- кол-во лет работника
	   SALARY     numeric(15, 2), -- зарплата работника
	   RISE       smallmoney,     -- премии
	   [STATUS]   bit,            -- статус работника 1-активен, 0 - не активен
	   [WEIGHT]   float,          -- вес работника
	   [HIREDATE] date,           -- дата найма работника
	 --[HIREDATETIME] datetime2   -- дата и время найма работника
	 --TITLE      char(50)        -- наименование должности работника
	   TITLE      nvarchar(50)
);

insert into  lesson1.Employee (TITLE)
values(N'й'),
      ('я')

select * from lesson1.Employee
