--======================================================================================================
-- Show select statement details
-- SELECT - выборка данных из таблиц/таблицы

-- Вырожденный вариант инструкции select
select N'T-SQL'           as [COLUMN1], -- поле/ атрибут 1
       2022               as [COLUMN2], -- поле/ атрибут 2
	   N'Arm ukraine now' as [COLUMN3]  -- поле/ атрибут 3 
;
--======================================================================================================
/*
	select - определяет наименования атрибутов, которые попадут в результирующий набор данных
	  from - определяет нименование объектов/ таблиц, из которых необходимо считать данные
	* - Все поля/столбцы/атрибуты таблиц/таблицы
*/
select e.*
  from [HumanResources].[Employee] as e;
--======================================================================================================
/*
	where - осуществляет фильтрацию строк
*/
select e.*
  from [HumanResources].[Employee] as e
 where e.Gender = 'M' -- работники мужского пола
;
--======================================================================================================
/*
	group by - формирует группы строк
*/
select e.JobTitle,
       count(*) as [empQty] 
  from [HumanResources].[Employee] as e
 where e.Gender = 'M' 
 group by e.JobTitle -- формирует группы строк. Группы формируются исходя из значений переданных в group by - e.JobTitle
;
--======================================================================================================
/*
	having - осуществляет фильтрацию групп. Используется для фильтрации агрегируемых выражений
*/
select e.JobTitle,
       count(*) as [empQty] 
  from [HumanResources].[Employee] as e
 where e.Gender = 'M' 
 group by e.JobTitle
having count(*)  = 1
;
--======================================================================================================
/*
	order by - осуществляет сортировку строк
*/
select e.JobTitle,
       count(*) as [empQty] 
  from [HumanResources].[Employee] as e
 where e.Gender = 'M' 
 group by e.JobTitle
having count(*)  = 1
order by e.JobTitle desc
;
--======================================================================================================
/*
* - Все поля/столбцы/атрибуты таблиц/таблицы

1	select     5 - определяет наименования атрибутов, которые попадут в результирующий набор данных

2	  from     1 - определяет нименование объектов/ таблиц, из которых необходимо считать данные

3	 where     2 - осуществляет фильтрацию строк	
4	 group by  3 - формирует группы строк
5	having     4 - осуществляет фильтрацию групп. Используется для фильтрации агрегируемых выражений
6	 order by  6 - осуществляет сортировку строк


asc  -- сортировка значений по возрастанию
desc -- сортировка значений по убыванию

*/

select e.* 
  from [HumanResources].[Employee] as e
 order by e.JobTitle asc,
          e.Gender desc
		  -- ...
;

select e.BusinessEntityID, -- уникальный идент. работника
       e.LoginID           -- логин работника
  from [HumanResources].[Employee] as e
 where -- условие фильтрации строк - наименование должности равняется 'Document Control Assistant'
       e.JobTitle = 'Document Control Assistant'
	   -- условие фильтрации строк - дата рождения равняется 1975-12-25
   and e.BirthDate = '19751225'
       -- or, not
;